# This file should contain all the record creation needed to seed the database with its default values.
# The data can then be loaded with the rails db:seed command (or created alongside the database with db:setup).
#
# Examples:
#
#   movies = Movie.create([{ name: 'Star Wars' }, { name: 'Lord of the Rings' }])
#   Character.create(name: 'Luke', movie: movies.first)

Article.create!(title: 'Прорезиненный асфальт уложили в Гродно на улице Василька', body: 'В Гродно в асфальт добавили резиновую крошку и стали укладывать на улице Василька, что в центре. АвтоГродно отправился на место работ, чтобы узнать у строителей преимущества нового покрытия.')
Article.create!(title: 'ГАИ опубликовала схему движения возле кладбища "Аульс" на Радуницу', body: ' 28 апреля православные христиане Беларуси отмечают Радуницу – день поминовения усопших. По сложившейся традиции в эти дни родственники массово посещают кладбища.')
Article.create!(title: 'Соскучился по любимой: поляк на велосипеде пытался незаконно попасть в Беларусь', body: 'Соскучился по любимой: поляк на велосипеде пытался незаконно попасть в Беларусь')
Article.create!(title: 'В Гродно пьяные "гаражные мастера" на автомобиле клиентки попали в ДТП и ушли домой. Появилось видео ДТП', body: 'Вчера, 22 апреля, около 23:00 на АЗС по улице Славинского Nissan Almera подрезал маршрутку и выехал на тротуар. Из легковушки вышли двое парней, оставили машину и направились в сторону Индурского шоссе. ')
Article.create!(title: 'Любители парковаться на местах для инвалидов - победили. Парковку вдоль Виленской ликвидировали', body: 'в пользу тех, кто любит парковаться на местах для инвалидов. На этот раз эта категория людей "победила" и парковку на улице Виленской убрали.')
Article.create!(title: 'Военным запретили стрелять на Гожском полигоне', body: 'На Гожском полигоне продолжаются соревнования среди танкистов. Сейчас они состязаются в маневрировании на танках, но победители станут известны позже. Из-за того, что в лесах местными исполнительными органами введён пятый класс пожароопасности,')
Article.create!(title: '«Белтехосмотр» останется без зарплат - к ним на ТО никто не ездит (и дело не только в коронавирусе)', body: 'Пока проект указа о так называемом дорожном налоге остается неподписанным, белорусские водители продолжают игнорировать техосмотр. Напомним, документ предусматривает отвязку госпошлины от процедуры ТО, ')
Article.create!(title: '"Скорее всего, будет две трети оклада": цеха "БЕЛДЖИ" приостанавливают работу', body: 'С 22 апреля подразделения автозавода "БЕЛДЖИ" ушли на целосменный простой. Это означает, что большинство работников отправляется в вынужденный отпуск.')
