team/app/controllers/commands_controller.rb

	def index
		#@command = Command.search(params).paginate(page: params[:page], per_page: 9)
		@command = Command.search(params).paginate(page: params[:page], per_page: 9)
---
SELECT "commands".* FROM "commands" LIMIT ? OFFSET ?  [["LIMIT", 9], ["OFFSET", 0]]
SELECT COUNT(*) FROM `commands` WHERE (name LIKE '%rrtee%')

	def show
		@command = Command.find(params[:id])
---
SELECT `commands`.* FROM `commands` WHERE `commands`.`id` = 1 LIMIT 1

	def edit
		@command = Command.find(params[:id])
---
SELECT `commands`.* FROM `commands` WHERE `commands`.`id` = 1 LIMIT 1

	def create
		@command = Command.new(command_params)
		if @command.save
---
INSERT INTO `commands` (`name`, `region`, `created_at`, `updated_at`) VALUES ('USSR', 'USSR', '2020-04-15 11:45:52.127977', '2020-04-15 11:45:52.127977')

	def update
		@command = Command.find(params[:id])
		if @command.update(command_params)
---
SELECT `commands`.* FROM `commands` WHERE `commands`.`id` = 7 LIMIT 1
UPDATE `commands` SET `commands`.`name` = 'Duanelb', `commands`.`updated_at` = '2020-04-15 11:37:29.814282' WHERE `commands`.`id` = 7