team/app/controllers/users_controller.rb

	def index
		#@command = Command.search(params).paginate(page: params[:page], per_page: 9)
		@user = User.search(params).paginate(page: params[:page], per_page: 12)
---
SELECT COUNT(*) FROM `users` WHERE (name LIKE '%Wal%')
SELECT `users`.* FROM `users` WHERE (name LIKE '%Wal%') LIMIT 12 OFFSET 0

	def edit
		@user = User.find(params[:command_id])
		@command = Command.all
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 9 LIMIT 1
SELECT `commands`.* FROM `commands`

	def new
		@user = User.new
		@command = Command.all
---
SELECT `commands`.* FROM `commands`

	def create

#		render plain: params[:user].inspect
		@user = User.new(user_params)
		if @user.save
---
INSERT INTO `users` (`name`, `phone`, `male`, `command_id`, `created_at`, `updated_at`, `password`) VALUES ('еукеукекуе', '4342342', 'm', 1, '2020-04-19 18:31:20.141332', '2020-04-19 18:31:20.141332', '123456')

	def update
		@user = User.find(params[:id])
		if @user.update(user_params)
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 106 LIMIT 1
UPDATE `users` SET `users`.`command_id` = 2, `users`.`updated_at` = '2020-04-15 15:07:57.774447' WHERE `users`.`id` = 106

	def destroy
		@user = User.find(params[:command_id])
		@user.destroy
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 105 LIMIT 1
DELETE FROM `users` WHERE `users`.`id` = 105