people/app/controllers/application_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1
---
	def current_user
	  @current_user ||= User.find(session[:id]) if session[:id]