people/app/controllers/users_controller.rb

  def index
       @user = User.paginate(page: params[:page], per_page: 12)
---
SELECT COUNT(*) FROM `users`