blog/app/policies/subject_policy.rb

SELECT `roles`.* FROM `roles` WHERE `roles`.`id` = 2 LIMIT 1
---
  def create?
    return true if user.present? && user.role.create_at?

SELECT `roles`.* FROM `roles` WHERE `roles`.`id` = 2 LIMIT 1
---
  def edit?
  return true if user.present? && user.role.update_at?

SELECT `roles`.* FROM `roles` WHERE `roles`.`id` = 2 LIMIT 1
---
  def destroy?
    return true if user.present? && user.role.delete_at?