blog/app/policies/user_policy.rb

SELECT `roles`.* FROM `roles` WHERE `roles`.`id` = 2 LIMIT 1
---
  def index?
      return true if user.present? && user.role.admin_at?

SELECT `roles`.* FROM `roles` WHERE `roles`.`id` = 1 LIMIT 1
---
  def edit?
  return true if user.present? && user.role.update_at?