blog/app/controllers/roles_controller.rb

  def index
    @role = authorize Role.all
    @user = User.all
---
SELECT `roles`.* FROM `roles`
SELECT `users`.* FROM `users`

  def edit
    @role = authorize Role.find(params[:id])
---
SELECT `roles`.* FROM `roles` WHERE `roles`.`id` = 1 LIMIT 1

  def update
    @role = Role.find(params[:id])
    # authorize @subject
    if @role.update(role_params)
---
SELECT `roles`.* FROM `roles` WHERE `roles`.`id` = 2 LIMIT 1
UPDATE `roles` SET `roles`.`create_at` = FALSE, `roles`.`updated_at` = '2020-04-26 20:40:40.654446' WHERE `roles`.`id` = 2

  def destroy
    @role = Role.find(params[:id])

    authorize @role
    @role.destroy
---
SELECT `roles`.* FROM `roles` WHERE `roles`.`id` = 3 LIMIT 1
DELETE FROM `roles` WHERE `roles`.`id` = 3