blog/app/controllers/subjects_controller.rb

SELECT `subjects`.* FROM `subjects`
---
  def index
    @subject = Subject.all

SELECT `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 1 LIMIT 1
---
  def show
    @subject = Subject.find(params[:id])

SELECT `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 1 LIMIT 1
---
  def edit
      @subject = authorize Subject.find(params[:id])

INSERT INTO `subjects` (`topic`, `description`, `status`, `created_at`, `updated_at`) VALUES ('Прорезиненный асфальт уложили в Гродно на улице Василька', 'В Гродно в асфальт добавили резиновую крошку и стали укладывать на улице Василька, что в центре. АвтоГродно отправился на место работ, чтобы узнать у строителей преимущества нового покрытия.', 'new', '2020-04-27 15:28:29.095551', '2020-04-27 15:28:29.095551')
---
  def create
    @subject = Subject.new(subject_params)
    authorize @subject
      if @subject.save

SELECT `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 1 LIMIT 1
DELETE FROM `subjects` WHERE `subjects`.`id` = 21
---
  def destroy
    @subject = Subject.find(params[:id])
    authorize @subject
    @subject.destroy