blog/app/controllers/users_controller.rb

SELECT `users`.* FROM `users`
---
  def index
    @user = authorize User.all

SELECT `users`.* FROM `users` WHERE `users`.`id` = 6 LIMIT 1
SELECT `roles`.* FROM `roles` WHERE `roles`.`id` = 5 LIMIT 1
---
  def show
    @user = User.find(params[:id])

    # @role = Role.joins(user: :role).select("create_at, update_at, read_at, delete_at, admin_at").where("user.id = 'params[:id]'")
    @role = Role.find(@user.role_id)

SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
---
  def edit
    @user = authorize User.find(params[:id])

SELECT `roles`.* FROM `roles` ORDER BY `roles`.`id` DESC LIMIT 1
INSERT INTO `roles` (`create_at`, `read_at`, `update_at`, `delete_at`, `admin_at`, `created_at`, `updated_at`) VALUES (FALSE, TRUE, FALSE, FALSE, FALSE, '2020-04-26 21:57:25.171809', '2020-04-26 21:57:25.171809')
INSERT INTO `users` (`role_id`, `created_at`, `updated_at`) VALUES (2, '2020-04-26 21:57:25.171809', '2020-04-26 21:57:25.171809')
---
  def create
    # render plain: params[:user].inspect

    @role = Role.last
    @user =  User.new(user_params.merge(role_id: @role.id ))
      if @user.save