blog/app/models/user.rb

 def encrypt_password
   if password.present?
     self.password = password
   end
 end

 private def set_role
   role_params = {:create_at => false, :update_at => false, :read_at => true, :delete_at => false, :admin_at =>false}
   @role =  Role.new(role_params)
   @role.save
---
INSERT INTO `roles` (`create_at`, `read_at`, `update_at`, `delete_at`, `admin_at`, `created_at`, `updated_at`) VALUES (FALSE, TRUE, FALSE, FALSE, FALSE, '2020-04-26 21:57:25.171809', '2020-04-26 21:57:25.171809')