audio/app/controllers/alboms_controller.rb

SELECT `geners`.* FROM `geners`
---
  def new
    @group = params[:group_id]
    @albom = Albom.new
    @gener = Gener.all

SELECT `alboms`.* FROM `alboms` WHERE `alboms`.`id` = 1 LIMIT 1
---
  def edit
    @albom = Albom.find(params[:id])

SELECT `alboms`.* FROM `alboms` WHERE `alboms`.`id` = 54 LIMIT 1
SELECT `songs`.* FROM `songs` WHERE `songs`.`albom_id` = 1
---
  def show
    # @albom = Albom.where(id: params[:id])
    @albom = Albom.find(params[:id])
    @song = Song.where(albom_id: params[:id])

SELECT `alboms`.* FROM `alboms` WHERE `alboms`.`id` = 55 LIMIT 1
UPDATE `alboms` SET `alboms`.`name` = 'ssssssssssss', `alboms`.`updated_at` = '2020-04-07 22:41:55.738750' WHERE `alboms`.`id` = 55
SELECT `groups`.* FROM `groups` WHERE `groups`.`id` = 5 LIMIT 1
---
  def update
    @albom = Albom.find(params[:id])
    if @albom.update(audio_params)
      redirect_to group_path(@albom.group_id)

DELETE FROM `alboms` WHERE `alboms`.`id` = 18
DELETE FROM `songs` WHERE `songs`.`id` = 75
SELECT `songs`.* FROM `songs` WHERE `songs`.`albom_id` = 56
SELECT `alboms`.* FROM `alboms` WHERE `alboms`.`id` = 52 LIMIT 1
DELETE FROM `alboms` WHERE `alboms`.`id` = 52
SELECT `groups`.* FROM `groups` WHERE `groups`.`id` = 4 LIMIT 1
SELECT `alboms`.* FROM `alboms` WHERE `alboms`.`group_id` = 4
---
  def destroy
      #render plain: params[:id].inspect
      Song.where(:albom_id => params[:id]).destroy_all
      @albom = Albom.find(params[:id])
      @albom.destroy
      redirect_to group_path(@albom.group_id)

INSERT INTO `alboms` (`name`, `description`, `group_id`, `artist_id`, `gener_id`, `created_at`, `updated_at`) VALUES ('Asd', 'asd', 11, 11, 6, '2020-04-08 09:38:28.727882', '2020-04-08 09:38:28.727882')
---
  def create
    Albom.transaction do
     @albom = Albom.new(audio_params)
   if @albom.save