audio/app/controllers/alboms_controller.rb

  def create
    #   render plain: params[:albom].inspect

     #@group = Group.where(params[:group_id])
     @albom = Albom.create(audio_params)



     #@albom = Albom.last
     #Song.find_or_create_by(name: params[song: :name], albom_id: @albom)

     # Albom.new(audio_params)


     # Song.new(audio_params::song) # albom_id: @albom )

     if @albom.save
        @song = @albom.song.build
      #  @albom = Albom.last
      #  @song = Song.new(params.require(:albom).permit(song_attributes: [:name]), albom_id: @albom )
        @song.save
---
UPDATE `alboms` SET `alboms`.`name` = 'New albon', `alboms`.`description` = 'dadsad', `alboms`.`updated_at` = '2020-04-06 12:43:41.297863' WHERE `alboms`.`id` = 13
INSERT INTO `songs` (`albom_id`, `created_at`, `updated_at`) VALUES (48, '2020-04-07 11:49:25.032802', '2020-04-07 11:49:25.032802')