audio/app/controllers/artists_controller.rb

    def edit
      @artist = Artist.find(params[:id])
---
SELECT `artists`.* FROM `artists` WHERE `artists`.`id` = 18 LIMIT 1

    def show
      @artist = Artist.where(id: params[:id])
---
SELECT `artists`.* FROM `artists` WHERE `artists`.`id` = 1 LIMIT 1

    def update
      @artist = Artist.find(params[:id])
---
SELECT `artists`.* FROM `artists` WHERE `artists`.`id` = 22 LIMIT 1

    def destroy
      Artist.transaction do
        @artist = Artist.find(params[:id])
        @artist.destroy
      end
        redirect_to group_path(@artist.group_id)
---
SELECT `artists`.* FROM `artists` WHERE `artists`.`id` = 20 LIMIT 1
DELETE FROM `artists` WHERE `artists`.`id` = 20
SELECT `groups`.* FROM `groups` WHERE `groups`.`id` = 0 LIMIT 1

    def create
      #render plain: params[:artist].inspect
      Artist.transaction do
        @artist = Artist.new(project_params)
        if @artist.save
---
INSERT INTO `artists` (`name`, `description`, `group_id`, `created_at`, `updated_at`) VALUES ('fsdfsdf', 'rewrewr', 5, '2020-04-07 22:19:48.966863', '2020-04-07 22:19:48.966863')