audio/app/controllers/geners_controller.rb

  def create
    Gener.transaction do
     @gener = Gener.new(audio_params)
   if @gener.save
---
INSERT INTO `geners` (`name`, `created_at`, `updated_at`) VALUES ('Bluz', '2020-04-08 08:53:17.381802', '2020-04-08 08:53:17.381802')