audio/app/controllers/group_controller.rb

SELECT `groups`.* FROM `groups`
---
  def index

    @group = Group.all

SELECT `groups`.* FROM `groups` WHERE `groups`.`id` = 1 LIMIT 1
---
  def edit
    @group = Group.find(params[:id])

SELECT `groups`.* FROM `groups` WHERE `groups`.`id` = 1 LIMIT 1
SELECT `artists`.* FROM `artists` WHERE `artists`.`group_id` = 1
SELECT audio_db.alboms.name as aname, audio_db.alboms.description, audio_db.alboms.image, audio_db.geners.name, audio_db.alboms.geners.podcast FROM `alboms` INNER JOIN `geners` ON `geners`.`id` = `alboms`.`gener_id` WHERE `alboms`.`group_id` = 1
---
  def show
    @group = Group.find(params[:id])
    @artist = Artist.where(group_id: params[:id])
    @albom = Albom.joins(:gener).select("alboms.id as aid, alboms.name as aname, alboms.description, alboms.image, geners.name").where(group_id: params[:id])

SELECT `groups`.* FROM `groups` WHERE `groups`.`id` = 5 LIMIT 1
UPDATE `groups` SET `groups`.`name` = 'Metallicaaattttt', `groups`.`updated_at` = '2020-04-07 22:32:05.253976' WHERE `groups`.`id` = 5
---
  def update
    @group = Group.find(params[:id])
    if @group.update(project_params)

SELECT `groups`.* FROM `groups` WHERE `groups`.`id` = 9 LIMIT 1
DELETE FROM `groups` WHERE `groups`.`id` = 9
---
  def destroy
    Group.transaction do
      @group = Group.find(params[:id])
      @group.destroy

INSERT INTO `groups` (`name`, `description`, `created_at`, `updated_at`) VALUES ('Metallicaaaaeeeee', 'eeeee', '2020-04-07 21:59:18.144464', '2020-04-07 21:59:18.144464')
---
  def create
    Group.transaction do
      @group = Group.new(project_params)
      if @group.save