audio/app/controllers/songs_controller.rb

  def edit
    @song = Song.find(params[:albom_id])
---
SELECT `songs`.* FROM `songs` WHERE `songs`.`id` = 55 LIMIT 1

  def update
    @song = Song.find(params[:albom_id])
    if @song.update(audio_params)
---
SELECT `songs`.* FROM `songs` WHERE `songs`.`id` = 55 LIMIT 1
UPDATE `songs` SET `songs`.`name` = 'tttttttt', `songs`.`updated_at` = '2020-04-07 22:59:24.551738' WHERE `songs`.`id` = 74

  def create
    Song.transaction do
     @song = Song.new(audio_params)
     if @song.save
---
INSERT INTO `songs` (`name`, `albom_id`, `created_at`, `updated_at`) VALUES ('dsdsad', 55, '2020-04-07 22:53:25.708214', '2020-04-07 22:53:25.708214')

  def destroy
    Song.transaction do
      @song = Song.find(params[:albom_id])
      @song.destroy
---
SELECT `songs`.* FROM `songs` WHERE `songs`.`id` = 80 LIMIT 1
DELETE FROM `songs` WHERE `songs`.`id` = 80