team/app/models/user.rb

  def self.search(params)
		user = all
		user = user.where("name LIKE ?", "%#{params[:search]}%") if params[:search]
---
SELECT `users`.* FROM `users` WHERE `users`.`name` = 'dolskanp' LIMIT 1