people/app/services/serviceLog.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 61 LIMIT 1
UPDATE `users` SET `users`.`name` = 'Metrouppl1111', `users`.`updated_at` = '2020-04-11 09:42:36.073343' WHERE `users`.`id` = 61
INSERT INTO `logs` (`name`, `name_before`, `kind`, `kind_before`, `created_at`, `updated_at`) VALUES ('Meydeldsh5555', 'Meydeldsh6666', 'Neutrality', 'Neutrality', '2020-04-11 10:16:13.256719', '2020-04-11 10:16:13.256719')
---
  def userUpdate(params = {})
    ActiveRecord::Base.transaction do
      @user = User.find(@id)
      @user.update(users_attributes)
      @log = Log.create(logs_attributes)
      @log.save

INSERT INTO `users` (`name`, `type`, `created_at`, `updated_at`) VALUES ('кекекеке', 'Neutrality', '2020-04-11 10:34:32.599598', '2020-04-11 10:34:32.599598')
INSERT INTO `logs` (`name`, `kind`, `created_at`, `updated_at`) VALUES ('кекекеке', 'Neutrality', '2020-04-11 10:34:32.835611', '2020-04-11 10:34:32.835611')
---
  def userCreate
    ActiveRecord::Base.transaction do
      @user = User.create(users_attributes)
      @user.save
      @log = Log.create(logs_attributes)