people/app/services/serviceDel.rb

  def userDestroy
      ActiveRecord::Base.transaction do
        @user = User.find(@id)
        user_params = {:name => @user.name, :kind => @kind}
        @log = Log.create(user_params)
        @user.destroy
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 104 LIMIT 1
INSERT INTO `logs` (`name`, `kind`, `created_at`, `updated_at`) VALUES ('еукеукекуе', 'delete', '2020-04-11 13:21:44.245584', '2020-04-11 13:21:44.245584')
DELETE FROM `users` WHERE `users`.`id` = 102