team/app/views/commands/show.html.erb

SELECT `users`.* FROM `users` WHERE `users`.`command_id` = 1
---
			<div class="row">
				<% @command.user.each do |user| %>